In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("raw_data .csv")
df2 = df.copy()

In [8]:
#groups the same type of data and we can calculate or perform operation on that grouped data
#Syntax : 
# df.groupby("parameter_on_baisis we group data")
df2.groupby("country")["income"].mean()
df2.groupby("country")["income"].min()

country
Canada    62000.0
China     51000.0
India     73000.0
Mexico    45000.0
Spain         NaN
USA       47000.0
Name: income, dtype: float64

In [13]:
#aggeragte
df2.groupby("country")["income"].agg(["min", "max","mean"])
#OR
df2.groupby("country")["income"].agg(min_salary="min", max_salary = "max", mean_salary = "mean")

         min_salary  max_salary  mean_salary
country
Canada      62000.0     62000.0      62000.0
China       51000.0     51000.0      51000.0
India       73000.0     73000.0      73000.0
Mexico      45000.0     45000.0      45000.0
Spain           NaN         NaN          NaN
USA         47000.0     62000.0      55400.0

In [14]:
df2.groupby("country").agg(
    max_salary = ("income","max"),
    avg_age = ("age", "mean")
)

         max_salary  avg_age
country
Canada      62000.0      NaN
China       51000.0     27.0
India       73000.0     45.0
Mexico      45000.0      NaN
Spain           NaN     34.0
USA         62000.0     29.5